# AddChoice

## Description
Adds an item to the component's choices.

The valid components are created by CreatePullDownMenu, CreatePullDownMenuGroupBox, CreateListBox, CreateListBoxN.

```pascal
PROCEDURE AddChoice(
				dialogID    : LONGINT;
				componentID : LONGINT;
				choiceText  : STRING;
				itemIndex   : INTEGER);
```

```python
def vs.AddChoice(dialogID, componentID, choiceText, itemIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|the dialog identifier given by CreateLayout or CreateResizableLayout|
|componentID|LONGINT|The identifier for the component that contains the choices.|
|choiceText|STRING|The text for the item that is about to be added.|
|itemIndex|INTEGER|The index after which the new item is to be added.|

## Remarks
For components created by CreateEnhancedPullDownMenu, InsertEnhancedPullDownMenuItem should be used.

## Examples
DialogLayoutPulldownMenu

```pascal
BEGIN
	CASE item OF
		SetupDialogC: BEGIN
			AddChoice(dialogID,  6,  GetPlugInString (3011),  0);
			FOR i := 1 TO gNumSymFolders DO
				AddChoice(dialogID,  6,  gFolderN [i],  i);

BEGIN
	CASE item OF
		SetupDialogC: BEGIN
			AddChoice(dialogID1,  6,  GetPlugInString (3011),  0);
			FOR i := 1 TO gNumSymFolders DO
				AddChoice(dialogID1,  6,  gFolderN [i],  i);

BEGIN
	value := fieldN [i];
	AddChoice(dialogID,  fieldID,  value,  i-i);
END;
```
```python
import vs

# Adds an item to the component's choices.
dialogID = 1
componentID = 2
choiceText = 'Example text'
itemIndex = 1

vs.AddChoice(dialogID, componentID, choiceText, itemIndex)
newObj = vs.LNewObj()  # handle to the newly created object
```

## See Also
For further information, please check out:
CreatePullDownMenu

CreatePullDownMenuGroupBox

CreateListBox

CreateListBoxN

## Version
Availability: from Vectorworks 2010

## Category
* Dialogs - Modern